import MainWrapper from "@components/MainWrapper"

import Container from "react-bootstrap/Container"
import FormControl from "react-bootstrap/FormControl"

import ToolkitProvider, { Search } from 'react-bootstrap-table2-toolkit';
import {NextSeo} from "next-seo";
import {useRouter} from "next/router";

import BootstrapTable from "react-bootstrap-table-next";

import paginationFactory from "react-bootstrap-table2-paginator";


const columns = [
    {
        dataField: 'code',
        text: 'Код',
    },
    {
        dataField: 'title',
        text: 'Продукт',
    },

    {
        dataField: 'currency',
        text: 'Валюта',
    },
    {
        dataField: 'price',
        text: 'Цена',
    }
]
const data=[
    {
        "code": "2900001759793",
        "title": "1С:Бухгалтерия 8 для Узбекистана. Электронная поставка",
        "currency": "USD",
        "price": "210"
    },
    {
        "code": "2900001759809",
        "title": "1С:Бухгалтерия 8 для Узбекистана. Комплект на 5 пользователей. Электронная поставка",
        "currency": "USD",
        "price": "490"
    },
    {
        "code": "2900001805322",
        "title": "1С:Розница 8 для Узбекистана. Базовая версия. Электронная поставка",
        "currency": "USD",
        "price": "70"
    },
    {
        "code": "2900001805315",
        "title": "1С:Розница 8 для Узбекистана. Электронная поставка",
        "currency": "USD",
        "price": "180"
    },
    {
        "code": "2900001848084",
        "title": "1С:Управление компанией 8 для Узбекистана. Электронная поставка",
        "currency": "USD",
        "price": "280"
    },
    {
        "code": "2900001848091",
        "title": "1С:Управление компанией 8 для Узбекистана. Комплект на 5 пользователей. Электронная поставка",
        "currency": "USD",
        "price": "515"
    },
    {
        "code": "2900001780018",
        "title": "1С:Управление торговлей 8 для Узбекистана. Электронная поставка",
        "currency": "USD",
        "price": "350"
    },
    {
        "code": "2900001824965",
        "title": "1С:Предприятие 8. NFR для Узбекистана для 1 пользователя. Электронная поставка",
        "currency": "USD"
    },
    {
        "code": "2900001824972",
        "title": "1С:Предприятие 8. NFR для Узбекистана для 10 пользователей + клиент-сервер. Электронная поставка",
        "currency": "USD"
    },

    {
        "code": "4601546041661",
        "title": "1С:Бухгалтерия 8. Базовая версия",
        "currency": "руб.",
        "price": "5400"
    },
    {
        "code": "4601546048264",
        "title": "1С:Упрощенка 8",
        "currency": "руб.",
        "price": "5400"
    },
    {
        "code": "4601546119094",
        "title": "1С:Предприниматель",
        "currency": "руб.",
        "price": "5400"
    },
    {
        "code": "4601546092564",
        "title": "1С:Бухгалтерия 8 ПРОФ. Поставка для розничного распространения.",
        "currency": "руб.",
        "price": "16800"
    },
    {
        "code": "4601546049025",
        "title": "1С:Бухгалтерия 8 ПРОФ. Поставка для розничного распространения (USB)",
        "currency": "руб.",
        "price": "20400"
    },
    {
        "code": "4601546092557",
        "title": "1С:Бухгалтерия 8 ПРОФ на 5 пользователей. Поставка для розничного распространения.",
        "currency": "руб.",
        "price": "33900"
    },
    {
        "code": "4601546049032",
        "title": "1С:Бухгалтерия 8 ПРОФ на 5 пользователей. Поставка для розничного распространения (USB)",
        "currency": "руб.",
        "price": "39000"
    },
    {
        "code": "4601546095183",
        "title": "1С:Бухгалтерия государственного учреждения 8. Базовая версия",
        "currency": "руб.",
        "price": "3600"
    },
    {
        "code": "4601546044433",
        "title": "1С:Зарплата и Управление Персоналом 8. Базовая версия.",
        "currency": "руб.",
        "price": "8100"
    },
    {
        "code": "4601546114006",
        "title": "1С:Зарплата и кадры государственного учреждения 8. Базовая версия",
        "currency": "руб.",
        "price": "10200"
    },
    {
        "code": "4601546113498",
        "title": "1С:Управление торговлей 8. Базовая версия. Редакция 11",
        "currency": "руб.",
        "price": "7200"
    },
    {
        "code": "4601546044440",
        "title": "1С:Управление торговлей 8. Базовая версия",
        "currency": "руб.",
        "price": "7200"
    },
    {
        "code": "4601546077189",
        "title": "1С:Розница 8. Базовая версия",
        "currency": "руб.",
        "price": "3600"
    },
    {
        "code": "4601546104014",
        "title": "1С:Управление нашей фирмой 8. Базовая версия",
        "currency": "руб.",
        "price": "5400"
    },
    {
        "code": "4601546046390",
        "title": "1С:Налогоплательщик 8",
        "currency": "руб.",
        "price": "1800"
    },
    {
        "code": "4601546043726",
        "title": "1С:Платежные документы 8",
        "currency": "руб.",
        "price": "660"
    },
    {
        "code": "4601546113115",
        "title": "1С:Бухгалтерия 8. Учебная версия. Издание 8.",
        "currency": "руб.",
        "price": "390"
    },

    {
        "code": "4601546071781",
        "title": "1С:Деньги 8",
        "currency": "руб.",
        "price": "660"
    },
    {
        "code": "4601546124241",
        "title": "1С:Договоры 8. Базовая версия",
        "currency": "руб.",
        "price": "5400"
    },
    {
        "code": "2900001850438",
        "title": "1С:Деньги 8. Электронная поставка",
        "currency": "руб.",
        "price": "600"
    },
    {
        "code": "2900002099065",
        "title": "1С:Касса приложение для ПК. Электронная поставка",
        "currency": "руб.",
        "price": "3300"
    },
    {
        "code": "2900002171136",
        "title": "1C:Кладовщик. Электронная поставка",
        "currency": "руб.",
        "price": "1800"
    },
    {
        "code": "2900001640114",
        "title": "1С:Мобильная касса. Электронная поставка",
        "currency": "руб.",
        "price": "1800"
    },
    {
        "code": "4601546116673",
        "title": "1С:Бухгалтерия 8. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "3300"
    },
    {
        "code": "2900001712941",
        "title": "1С:Бухгалтерия 8 для 1. Электронная поставка.",
        "currency": "руб.",
        "price": "3000"
    },
    {
        "code": "2900001712958",
        "title": "1С:БизнесСтарт. Электронная поставка",
        "currency": "руб.",
        "price": "3000"
    },
    {
        "code": "4601546116680",
        "title": "1С:Бухгалтерия 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "4601546092540",
        "title": "1С:Бухгалтерия 8 ПРОФ",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "4601546041654",
        "title": "1С:Бухгалтерия 8 ПРОФ (USB)",
        "currency": "руб.",
        "price": "16200"
    },
    {
        "code": "2900001850186",
        "title": "1С:Бухгалтерия 8 ПРОФ. Комплект на 5 пользователей. Электронная поставка",
        "currency": "руб.",
        "price": "26000"
    },
    {
        "code": "4601546092649",
        "title": "1С:Бухгалтерия 8. Комплект на 5 пользователей",
        "currency": "руб.",
        "price": "26000"
    },
    {
        "code": "4601546041678",
        "title": "1С:Бухгалтерия 8. Комплект на 5 пользователей (USB)",
        "currency": "руб.",
        "price": "30200"
    },
    {
        "code": "2900001004596",
        "title": "1С:Бухгалтерия 8 OEM (25 шт)",
        "currency": "руб."
    },
    {
        "code": "2900001850445",
        "title": "1С:Бухгалтерия 8 КОРП. Электронная поставка",
        "currency": "руб.",
        "price": "33600"
    },
    {
        "code": "4601546091970",
        "title": "1С:Бухгалтерия 8 КОРП",
        "currency": "руб.",
        "price": "33600"
    },
    {
        "code": "4601546063786",
        "title": "1С:Бухгалтерия 8 КОРП (USB)",
        "currency": "руб.",
        "price": "38500"
    },
    {
        "code": "2900001963466",
        "title": "1С:Бухгалтерия некоммерческой организации 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "14400"
    },
    {
        "code": "2900002088250",
        "title": "1С:Бухгалтерия некоммерческой организации 8 КОРП. Электронная поставка",
        "currency": "руб.",
        "price": "43200"
    },
    {
        "code": "2900002015881",
        "title": "1С:Садовод. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "5400"
    },
    {
        "code": "4601546140531",
        "title": "1С:Садовод. Базовая версия",
        "currency": "руб.",
        "price": "5400"
    },
    {
        "code": "2900002015867",
        "title": "1С:Садовод. Электронная поставка",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "4601546140524",
        "title": "1С:Садовод",
        "currency": "руб.",
        "price": "16800"
    },
    {
        "code": "2900001897624",
        "title": "1С:Бухгалтерия государственного учреждения 8. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "3300"
    },
    {
        "code": "2900001850308",
        "title": "1С:Бухгалтерия государственного учреждения 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "14400"
    },
    {
        "code": "4601546097958",
        "title": "1С:Бухгалтерия государственного учреждения 8 ПРОФ",
        "currency": "руб.",
        "price": "14400"
    },
    {
        "code": "4601546090300",
        "title": "1С:Бухгалтерия государственного учреждения 8 ПРОФ (USB)",
        "currency": "руб.",
        "price": "17700"
    },
    {
        "code": "2900001871433",
        "title": "1С:Свод отчетов 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "108000"
    },
    {
        "code": "4601546092038",
        "title": "1С:Свод отчетов 8 ПРОФ",
        "currency": "руб.",
        "price": "108000"
    },
    {
        "code": "4601546063823",
        "title": "1С:Свод отчетов 8 ПРОФ (USB)",
        "currency": "руб.",
        "price": "120900"
    },
    {
        "code": "4601546066299",
        "title": "1С:Государственные и муниципальные закупки 8",
        "currency": "руб.",
        "price": "276000"
    },
    {
        "code": "2900002158007",
        "title": "1С:Бюджетная отчетность 8. Электронная поставка",
        "currency": "руб.",
        "price": "33600"
    },
    {
        "code": "4601546097972",
        "title": "1С:Бюджетная отчетность 8",
        "currency": "руб.",
        "price": "33600"
    },
    {
        "code": "4601546077769",
        "title": "1С:Бюджетная отчетность 8 (USB)",
        "currency": "руб.",
        "price": "38500"
    },
    {
        "code": "4601546096234",
        "title": "1С:Бюджет поселения 8",
        "currency": "руб.",
        "price": "40000"
    },
    {
        "code": "4601546096241",
        "title": "1С:Бюджет поселения 8. Базовая версия",
        "currency": "руб.",
        "price": "22000"
    },
    {
        "code": "4601546102881",
        "title": "1С:Бюджет муниципального образования 8",
        "currency": "руб.",
        "price": "276000"
    },
    {
        "code": "4601546110473",
        "title": "Закупки. Дополнение к 1С:Бухгалтерия государственного учреждения 8",
        "currency": "руб.",
        "price": "29600"
    },
    {
        "code": "2900002158014",
        "title": "1С:Вещевое довольствие 8. Электронная поставка",
        "currency": "руб.",
        "price": "30000"
    },
    {
        "code": "4601546114693",
        "title": "1С:Вещевое довольствие 8",
        "currency": "руб.",
        "price": "30000"
    },
    {
        "code": "2900001850391",
        "title": "1С:Управление торговлей 8. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "6700"
    },
    {
        "code": "2900001850162",
        "title": "1С:Управление торговлей ПРОФ 8. Электронная поставка",
        "currency": "руб.",
        "price": "22600"
    },
    {
        "code": "4601546092595",
        "title": "1С:Предприятие 8. Управление торговлей",
        "currency": "руб.",
        "price": "22600"
    },
    {
        "code": "4601546041814",
        "title": "1С:Предприятие 8. Управление торговлей (USB)",
        "currency": "руб.",
        "price": "27300"
    },
    {
        "code": "2900001195942",
        "title": "1С:Управление торговлей 8, ред. 11. Обновление.",
        "currency": "руб.",
        "price": "300"
    },
    {
        "code": "1CBITRMBUT",
        "title": "1С:Предприятие 8. Управление Торговлей (USB) + 1С-Битрикс: Управление сайтом. Малый Бизнес",
        "currency": "руб.",
        "price": "48365"
    },
    {
        "code": "1CBITRBUT",
        "title": "1С:Предприятие 8. Управление Торговлей (USB) + 1С Битрикс: Управление сайтом. Бизнес",
        "currency": "руб.",
        "price": "79815"
    },
    {
        "code": "2900001832397",
        "title": "1С:Розница 8. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "3300"
    },
    {
        "code": "2900001850179",
        "title": "1С:Розница 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "4601546092601",
        "title": "1С:Розница 8 ПРОФ",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "4601546048042",
        "title": "1С:Розница 8 ПРОФ (USB)",
        "currency": "руб.",
        "price": "16200"
    },
    {
        "code": "2900001705226",
        "title": "1С:Управление нашей фирмой 8. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "4600"
    },
    {
        "code": "2900001705240",
        "title": "1С:Управление нашей фирмой 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "17400"
    },
    {
        "code": "4601546081124",
        "title": "1С:Управление нашей фирмой 8 ПРОФ",
        "currency": "руб.",
        "price": "17400"
    },
    {
        "code": "2900001705257",
        "title": "1С:Управление нашей фирмой 8 на 5 пользователей. Электронная поставка",
        "currency": "руб.",
        "price": "31800"
    },
    {
        "code": "4601546086211",
        "title": "1С:Управление нашей фирмой 8 на 5 пользователей",
        "currency": "руб.",
        "price": "31800"
    },
    {
        "code": "2900001856744",
        "title": "1С:Зарплата и управление персоналом 8. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "7400"
    },
    {
        "code": "2900001850223",
        "title": "1С:Зарплата и управление персоналом 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "22600"
    },
    {
        "code": "4601546092588",
        "title": "1С:Зарплата и Управление Персоналом 8",
        "currency": "руб.",
        "price": "22600"
    },
    {
        "code": "4601546041807",
        "title": "1С:Зарплата и Управление Персоналом 8 (USB)",
        "currency": "руб.",
        "price": "27300"
    },
    {
        "code": "2900001850230",
        "title": "1С:Зарплата и управление персоналом 8 КОРП. Электронная поставка",
        "currency": "руб.",
        "price": "109000"
    },
    {
        "code": "4601546081506",
        "title": "1С:Зарплата и управление персоналом 8 КОРП",
        "currency": "руб.",
        "price": "109000"
    },
    {
        "code": "2900001729819",
        "title": "1С:Зарплата и кадры государственного учреждения 8. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "9200"
    },
    {
        "code": "2900001729826",
        "title": "1С:Зарплата и кадры государственного учреждения 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "28100"
    },
    {
        "code": "4601546113993",
        "title": "1С:Зарплата и кадры государственного учреждения 8",
        "currency": "руб.",
        "price": "28100"
    },
    {
        "code": "2900001892971",
        "title": "1С:Зарплата и кадры государственного учреждения 8 КОРП. Электронная поставка",
        "currency": "руб.",
        "price": "136000"
    },
    {
        "code": "4601546132079",
        "title": "1С:Зарплата и кадры государственного учреждения 8 КОРП",
        "currency": "руб.",
        "price": "136000"
    },
    {
        "code": "4601546087577",
        "title": "1С:Зарплата и кадры образовательной организации",
        "currency": "руб.",
        "price": "21600"
    },
    {
        "code": "4601546091499",
        "title": "1С:Предприятие 8. Набор для бухгалтерии образовательной организации",
        "currency": "руб.",
        "price": "46000"
    },
    {
        "code": "4601546092656",
        "title": "1С:Предприятие 8. Комплект прикладных решений на 5 пользователей",
        "currency": "руб.",
        "price": "50400"
    },
    {
        "code": "4601546042903",
        "title": "1С:Предприятие 8. Комплект прикладных решений на 5 пользователей (USB)",
        "currency": "руб.",
        "price": "57000"
    },
    {
        "code": "2900001850193",
        "title": "1С:Комплексная автоматизация 8. Электронная поставка",
        "currency": "руб.",
        "price": "61700"
    },
    {
        "code": "4601546122445",
        "title": "1С:Комплексная автоматизация 8. Редакция 2",
        "currency": "руб.",
        "price": "61700"
    },
    {
        "code": "2900002153033",
        "title": "1С:Комплексная автоматизация для 10 пользователей + клиент-сервер (x86-64). Электронная поставка",
        "currency": "руб.",
        "price": "164900"
    },
    {
        "code": "4601546142894",
        "title": "1С:Комплексная автоматизация для 10 пользователей + клиент-сервер (x86-64)",
        "currency": "руб.",
        "price": "164900"
    },
    {
        "code": "2900002088120",
        "title": "1С:Корпорация. Корпоративная электронная поставка",
        "currency": "руб.",
        "price": "8670000"
    },
    {
        "code": "2900001871419",
        "title": "1С:Корпорация. Электронная поставка",
        "currency": "руб.",
        "price": "2050000"
    },
    {
        "code": "4601546129260",
        "title": "1С:Корпорация",
        "currency": "руб.",
        "price": "2050000"
    },
    {
        "code": "2900002080964",
        "title": "1С:ERP. Управление холдингом. Корпоративная электронная поставка",
        "currency": "руб.",
        "price": "8117000"
    },
    {
        "code": "2900001970198",
        "title": "1С:ERP. Управление холдингом. Электронная поставка",
        "currency": "руб.",
        "price": "1950000"
    },
    {
        "code": "2900001871327",
        "title": "1С:ERP Управление предприятием 2. Корпоративная поставка. Электронная поставка",
        "currency": "руб.",
        "price": "2757600"
    },
    {
        "code": "4601546129192",
        "title": "1С:ERP Управление предприятием 2. Корпоративная поставка",
        "currency": "руб.",
        "price": "2757600"
    },
    {
        "code": "2900001871365",
        "title": "1С:Предприятие 8. ERP Управление предприятием 2. Электронная поставка",
        "currency": "руб.",
        "price": "432000"
    },
    {
        "code": "4601546109118",
        "title": "1С:Предприятие 8. ERP Управление предприятием 2",
        "currency": "руб.",
        "price": "432000"
    },
    {
        "code": "2900001871372",
        "title": "1С:Предприятие 8 ПРОФ. ERP Управление предприятием 2 + Документооборот КОРП. Сервер (x86-64). 50 клиентских лицензий. Электронная поставка",
        "currency": "руб.",
        "price": "768000"
    },
    {
        "code": "4601546131478",
        "title": "1С:Предприятие 8 ПРОФ. ERP Управление предприятием 2 + Документооборот КОРП. Сервер (x86-64). 50 клиентских лицензий",
        "currency": "руб.",
        "price": "768000"
    },
    {
        "code": "2900002097511",
        "title": "1С:ERP WE Beta. Электронная поставка",
        "currency": "руб.",
        "price": "200000"
    },
    {
        "code": "2900001871396",
        "title": "1С:Управление холдингом 8. Корпоративная поставка. Электронная поставка",
        "currency": "руб.",
        "price": "4400000"
    },
    {
        "code": "4601546126818",
        "title": "1С:Управление холдингом 8. Корпоративная поставка",
        "currency": "руб.",
        "price": "4400000"
    },
    {
        "code": "2900001871389",
        "title": "1С:Управление холдингом 8. Электронная поставка",
        "currency": "руб.",
        "price": "1250000"
    },
    {
        "code": "4601546114570",
        "title": "1С:Управление холдингом 8",
        "currency": "руб.",
        "price": "1250000"
    },
    {
        "code": "2900001844284",
        "title": "1С:Бухгалтерия КОРП МСФО. Электронная поставка",
        "currency": "руб.",
        "price": "50000"
    },
    {
        "code": "2900001844086",
        "title": "1С:Бухгалтерия КОРП МСФО",
        "currency": "руб.",
        "price": "50000"
    },
    {
        "code": "2900002009880",
        "title": "1С:Налоговый мониторинг. Бухгалтерия КОРП МСФО. Электронная поставка",
        "currency": "руб.",
        "price": "900000"
    },
    {
        "code": "2900001803892",
        "title": "1С:Учет обращений. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "4600"
    },
    {
        "code": "2900001803915",
        "title": "1С:Учет обращений ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "2900001803922",
        "title": "1С:Учет обращений на 5 пользователей. Электронная поставка",
        "currency": "руб.",
        "price": "26000"
    },
    {
        "code": "2900001850919",
        "title": "1С:Договоры 8. Базовая версия. Электронная поставка",
        "currency": "руб.",
        "price": "4600"
    },
    {
        "code": "2900001850926",
        "title": "1С:Договоры 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "4601546123947",
        "title": "1С:Договоры 8 ПРОФ",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "2900001850933",
        "title": "1С:Договоры 8 на 5 пользователей. Электронная поставка",
        "currency": "руб.",
        "price": "26000"
    },
    {
        "code": "4601546124258",
        "title": "1С:Договоры 8 на 5 пользователей",
        "currency": "руб.",
        "price": "26000"
    },
    {
        "code": "2900001850292",
        "title": "1С:Document Management 8. Электронная поставка",
        "currency": "руб.",
        "price": "300000"
    },
    {
        "code": "4601546125552",
        "title": "1C:Document Management 8",
        "currency": "руб.",
        "price": "300000"
    },
    {
        "code": "2900001850278",
        "title": "1С:Документооборот 8 ПРОФ. Электронная поставка",
        "currency": "руб.",
        "price": "36000"
    },
    {
        "code": "4601546081117",
        "title": "1С:Документооборот 8 ПРОФ",
        "currency": "руб.",
        "price": "36000"
    },
    {
        "code": "2900001850285",
        "title": "1С:Документооборот 8 КОРП. Электронная поставка",
        "currency": "руб.",
        "price": "187000"
    },
    {
        "code": "4601546085931",
        "title": "1С:Документооборот 8 КОРП",
        "currency": "руб.",
        "price": "187000"
    },
    {
        "code": "2900001850346",
        "title": "1С:Документооборот государственного учреждения 8. Электронная поставка",
        "currency": "руб.",
        "price": "117600"
    },
    {
        "code": "4601546099563",
        "title": "1С:Документооборот государственного учреждения 8",
        "currency": "руб.",
        "price": "117600"
    },
    {
        "code": "4601546137623",
        "title": "1С:Документооборот государственного учреждения КОРП. Регион",
        "currency": "руб.",
        "price": "1490000"
    },
    {
        "code": "2900001154666",
        "title": "Комплект перехода на ред.1.4 Консолидация ПРОФ",
        "currency": "руб.",
        "price": "7000"
    },
    {
        "code": "4601546062383",
        "title": "1С:Розница 8 OEM (25 шт)",
        "currency": "руб."
    },
    {
        "code": "2900002112566",
        "title": "1С:Корпоративный инструментальный пакет 8. Электронная поставка",
        "currency": "руб.",
        "price": "100800"
    },
    {
        "code": "4601546046567",
        "title": "1С:Корпоративный инструментальный пакет 8",
        "currency": "руб.",
        "price": "100800"
    },
    {
        "code": "2900002107524",
        "title": "1С:Сервер взаимодействия. Электронная поставка",
        "currency": "руб.",
        "price": "50400"
    },
    {
        "code": "4601546107480",
        "title": "1С:Предприятие 8. Система проектирования прикладных решений",
        "currency": "руб.",
        "price": "7200"
    },
    {
        "code": "2900002165678",
        "title": "1С:Предприятие. Облачная подсистема Фреш. Электронная поставка",
        "currency": "руб.",
        "price": "72000"
    },
    {
        "code": "4601546102546",
        "title": "1С:Предприятие. Облачная подсистема Фреш",
        "currency": "руб.",
        "price": "72000"
    },
    {
        "code": "2900001484008",
        "title": "1С:Предприятие 8.3. Обновление платформы",
        "currency": "руб.",
        "price": "1400"
    },
    {
        "code": "2900002172386",
        "title": "1С:Предприятие 8.3. Технологическая электронная поставка",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "4601546111548",
        "title": "1С:Предприятие 8.3. Технологическая поставка",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "4601546092632",
        "title": "1С:Предприятие 8.2. Технологическая поставка",
        "currency": "руб.",
        "price": "13000"
    },
    {
        "code": "4601546077264",
        "title": "1С:Предприятие 8.2. Технологическая поставка (USB)",
        "currency": "руб.",
        "price": "16200"
    },
    {
        "code": "4601546018328",
        "title": "1С:Предприятие. Технология создания внешних компонент",
        "currency": "руб.",
        "price": "750"
    },
    {
        "code": "4601546119070",
        "title": "Защищенный программный комплекс 1С:Предприятие 8.3z (x86-32)",
        "currency": "руб.",
        "price": "18000"
    },
    {
        "code": "4601546119087",
        "title": "Защищенный программный комплекс 1С:Предприятие 8.3z (x86-64)",
        "currency": "руб.",
        "price": "54000"
    },
    {
        "code": "4601546142504",
        "title": "Защищенный программный комплекс 1С:Предприятие 8s. Технологическая поставка",
        "currency": "руб.",
        "price": "39000"
    },
    {
        "code": "2900002122862",
        "title": "Защищенный программный комплекс 1С:Предприятие 8s. Поставка для отработки программы на 20 пользователей + клиент-сервер. NFR",
        "currency": "руб."
    },
    {
        "code": "2900001526333",
        "title": "1С:Предприятие 8.3. NFR для 1 пользователя",
        "currency": "руб."
    },
    {
        "code": "2900001526340",
        "title": "1С:Предприятие 8.3. NFR для 10 пользователей + клиент-сервер",
        "currency": "руб."
    },
    {
        "code": "2900002202397",
        "title": "1С:Предприятие 8 NFR. Облачная подсистема Фреш. Электронная поставка",
        "currency": "руб."
    },
    {
        "code": "2900001027991",
        "title": "1С:Свод отчетов 8 NFR",
        "currency": "руб."
    },
    {
        "code": "2900001079891",
        "title": "1С:Государственные и муниципальные закупки 8 NFR для 1 пользователя",
        "currency": "руб."
    },
    {
        "code": "2900001362320",
        "title": "1С:Бюджет поселения 8.NFR для одного пользователя",
        "currency": "руб."
    },
    {
        "code": "2900001435567",
        "title": "1С:Бюджет муниципального образования 8. NFR",
        "currency": "руб."
    },
    {
        "code": "2900001538060",
        "title": "Закупки. Дополнение к 1С:Бухгалтерия государственного учреждения 8. Дополнение к NFR",
        "currency": "руб."
    },
    {
        "code": "2900001268196",
        "title": "1С:Зарплата и кадры образовательной организации. NFR",
        "currency": "руб."
    },
    {
        "code": "2900001971454",
        "title": "1С:ERP. Управление холдингом. NFR. Электронная поставка",
        "currency": "руб."
    },
    {
        "code": "2900002145953",
        "title": "1С:ERP Управление предприятием 2 NFR. Электронная поставка",
        "currency": "руб."
    },
    {
        "code": "2900001528252",
        "title": "1С:Предприятие 8 NFR. ERP Управление предприятием 2",
        "currency": "руб."
    },
    {
        "code": "2900002097528",
        "title": "1C:ERP WE Beta. NFR. Электронная поставка",
        "currency": "руб."
    },
    {
        "code": "2900002145960",
        "title": "1С:Управление холдингом 8 NFR. Электронная поставка",
        "currency": "руб."
    },
    {
        "code": "2900001565103",
        "title": "1С:Управление холдингом 8 NFR",
        "currency": "руб."
    },
    {
        "code": "2900001844314",
        "title": "1С:Бухгалтерия КОРП МСФО NFR",
        "currency": "руб."
    },
    {
        "code": "2900002009897",
        "title": "1С:Налоговый мониторинг. Бухгалтерия КОРП МСФО NFR. Электронная поставка",
        "currency": "руб."
    },
    {
        "code": "2900001965606",
        "title": "1С:Бухгалтерия некоммерческой организации 8. Дополнение к NFR. Электронная поставка",
        "currency": "руб."
    },
    {
        "code": "2900002088359",
        "title": "1С:Бухгалтерия некоммерческой организации 8 КОРП. Дополнение к NFR. Электронная поставка",
        "currency": "руб."
    },
    {
        "code": "2900002016192",
        "title": "1С:Садовод. Дополнение к NFR. Электронная поставка",
        "currency": "руб."
    },

    {
        "code": "2900000722033",
        "title": "1С:Корпоративный инструментальный пакет 8 NFR",
        "currency": "руб."
    },
    {
        "code": "2900002162424",
        "title": "1С:Предприятие 8. Комплект разработчика. Электронная поставка",
        "currency": "руб.",
        "price": "630"
    },
    {
        "code": "4601546046574",
        "title": "1С:Предприятие 8. Комплект специалиста по разработке и внедрению",
        "currency": "руб.",
        "price": "4000"
    },
    {
        "code": "2900002137880",
        "title": "1С:Предприятие 8. Обновление комплекта для вузов. Электронная поставка",
        "currency": "руб."
    },
    {
        "code": "2900001788960",
        "title": "1С:Предприятие 8. Электронная поставка для Армении, Грузии, Литвы",
        "currency": "USD",
        "price": "250"
    }
]

const { SearchBar } = Search;

const Products = () => {
    const router = useRouter()
    return (
        <>
            <NextSeo
                title={"Ависта 1С Программы делового назначения"}
                description={"ООО Ависта, Программы делового назначения"}
                canonical={process.env.HOST_PRODUCTION_URL}
                url={`${process.env.HOST_PRODUCTION_URL}${router.pathname}`}
                openGraph={{
                    locale: "ru_RU",
                    article: {
                        tags: ["Ависта", "1С", "Продукция", "Товары"]
                    }
                }}
            />
            <MainWrapper>
                <Container className={"py-5"}>
                    <ToolkitProvider
                        keyField="id"
                        data={ data }
                        columns={ columns }
                        search
                    >
                        {
                            props => (
                                <div>
                                    <h3>Программы делового назначения:</h3>
                                    <MySearch { ...props.searchProps } />
                                    <hr />
                                    <BootstrapTable
                                        { ...props.baseProps }
                                        pagination={ paginationFactory() }
                                    />

                                </div>
                            )
                        }
                    </ToolkitProvider>
                </Container>
            </MainWrapper>
        </>
    )
}

const MySearch = (props) => {
    let input;
    return (
        <div className={"py-2"}>
            <FormControl
                className="form-control"
                ref={ n => input = n }
                type="text"
                placeholder={"Поиск"}
                onChange={() => props.onSearch(input.value)}
            />
        </div>
    );
};

export default Products